// -------------------------------------------------------------
// 변위맵
// 
// Copyright (c) 2002,2003 IMAGIRE Takashi. All rights reserved.
// -------------------------------------------------------------

// -------------------------------------------------------------
// 정점셰이더
//  c0 - c3 - 좌표변환
//  c4.x    - 변위하는 양
//  c12     - (0.0, 0.5, 1.0, 2.0)
//  c13     - 광원의 방향
// -------------------------------------------------------------
VertexShader VS = asm
{
    vs_1_1
    
    dcl_position0 v0	// 위치선언
    dcl_normal0   v1	// 법선선언
    dcl_texcoord0 v2	// 텍스처좌표 선언
    dcl_sample0   v3	// 변위맵 선언
    
    mul r0, v1, c4.x    // 법선에 변위하는 양을 곱한다
    mul r0, r0, v3.x    // ★여기에 맵의 값을 곱한다
    add r0, v0, r0      // 변위를 정점에 더한다
    mov r0.w, v0.w      // w성분은 1
    m4x4 oPos, r0, c0   // 좌표변환
    
	dp3 r0, v1, c13		// 램버트 확산
	max r0, r0, c12.x
	add oD0, r0, c13.w
	
    mov oT0, v2         // 텍스처좌표
};
// -------------------------------------------------------------
// 픽셀셰이더
// -------------------------------------------------------------
PIXELSHADER PS = asm
{
    ps.1.1
	
	tex t0
	
	mul r0, t0, v0
};
// -------------------------------------------------------------
// 테크닉
// -------------------------------------------------------------
technique TShader
{
    pass P0
    {
        // 셰이더
        VertexShader = <VS>;
        PixelShader  = <PS>;
    }
}
