// -------------------------------------------------------------
// 그림자볼륨
// 
// Copyright (c) 2002,2003 IMAGIRE Takashi. All rights reserved.
// -------------------------------------------------------------

// -------------------------------------------------------------
// 전역변수
// -------------------------------------------------------------
float4x4 mWVP;		// 로컬에서 투영공간으로의 좌표변환
float4	 vLightPos;	// 광원위치

// -------------------------------------------------------------
// 정점셰이더에서 픽셀셰이더로 넘기는 데이터
// -------------------------------------------------------------
struct VS_OUTPUT
{
	float4 Pos		: POSITION;
};

// -------------------------------------------------------------
// 정점셰이더
// -------------------------------------------------------------
VS_OUTPUT VS (
      float4 Pos    : POSITION,          // 모델정점
      float3 Normal : NORMAL	         // 모델법선
){
    VS_OUTPUT Out = (VS_OUTPUT)0;        // 출력데이터
	
    // 앞면이될 면을 뒤쪽으로 확대
	float4 dir = vLightPos - Pos;
    float LN = dot( Normal, dir );
    float scale = (0<LN) ? 0.0f : 1.0f;
    
    // 좌표변환
    Pos.xyz -= 0.001f*Pos;// 롁궕궓궖궶궋귝궎궸룺궢뢫귕귡
    Out.Pos = mul( Pos - scale * dir, mWVP );
    
    return Out;
}
// -------------------------------------------------------------
// 테크닉
// -------------------------------------------------------------
technique TShader
{
    pass P0
    {
        // 셰이더
        VertexShader = compile vs_1_1 VS();
        PixelShader  = NULL;
    }
}
